Config/Catalogs/ОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОсновныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНФА</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНФА</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКОФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизационнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрупповойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФАИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетСодержатьДрагМатериалы</Name>
					<Comment>Содержание драг. материалов будет определено после списания и утилизации.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмуществоКазны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументацияЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументацияЭкземпляров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОК01394</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодПоОКОФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКТРУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркируемойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркируемойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиныйКодификаторПредметовСнабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйНомерОбъектаКапвложенийДоПоступления</Name>
					<Comment>Учетный номер объекта капвложений до поступления в учреждение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDНоменклатурыОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонтураИдентификацииСведенийОбОбъекте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзменениеПравообладанияОбременения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПраваОбременения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Правообладания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПрава</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ОсновныеСредства/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(ЭтотОбъект);
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	ИспользоватьПодключаемоеОборудование = Истина;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КомандыФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	УстановитьОграничениеПолей();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КомандыФормы);
	// Конец ИнтеграцияС1СДокументооборотом

	// ИнтеграцияС1САрхивом  
	ПараметрыРазмещения = ОбменСАрхивом.ПараметрыРазмещенияЭлементов();
	ПараметрыРазмещения.ИмяСписка = "Список";
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец ИнтеграцияС1САрхивом
	
	Если Метаданные.Имя <> "БухгалтерияГосударственногоУчрежденияКОРП" Тогда //НЕ КОРП
		ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, "СканерШтрихкода");
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода"));
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр[ 1 ] = Неопределено Тогда
				ТекКод = Параметр[ 0 ];
			Иначе
				ТекКод = Параметр[ 1 ][ 1 ];
			КонецЕсли;
			ОС = НайтиОбъектПоШтрихкоду(ТекКод);
			Если ЗначениеЗаполнено(ОС) Тогда
				Элементы.Список.ТекущаяСтрока = ОС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтборИнвентарныйНомерПриИзменении(Элемент)
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборСчетУчетаПриИзменении(Элемент)
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборЦМОПриИзменении(Элемент)
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПодразделениеПриИзменении(Элемент)
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборСостояниеПриИзменении(Элемент)
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборРеестровыйНомерПриИзменении(Элемент)
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборИнвентарныйНомерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборИнвентарныйНомер) Тогда
		ИспользоватьОтборИнвентарныйНомер = Истина;
	Конецесли;
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетУчетаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборСчетУчета) Тогда
		ИспользоватьОтборСчетУчета = Истина;
	Конецесли;
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборЦМОПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборЦМО) Тогда
		ИспользоватьОтборЦМО = Истина;
	Конецесли;
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборПодразделение) Тогда
		ИспользоватьОтборПодразделение = Истина;
	Конецесли;
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		ИспользоватьОтборСостояние = Истина;
	Конецесли;
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборРеестровыйНомерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборРеестровыйНомер) Тогда
		ИспользоватьОтборРеестровыйНомер = Истина;
	Конецесли;
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьБыстрыеОтборыПриИзменении(Элемент)
	УстановитьБыстрыйОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборЦМОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуВыбораЭлементаОтбора(Элемент, СтандартнаяОбработка, "ЦМО", ОтборЦМО);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуВыбораЭлементаОтбора(Элемент, СтандартнаяОбработка, "Подразделения", ОтборПодразделение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	КлючеваяОперация ="СозданиеФормыОсновныеСредства";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	КлючеваяОперация ="ОткрытиеФормыОсновныеСредства";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБГУ.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Определение необходимых данных
	
	ДанныеПервойСтроки = Неопределено;
	Для Каждого ТекСтрока Из Строки Цикл
		ДанныеПервойСтроки = ТекСтрока.Значение.Данные;
		Прервать;
	КонецЦикла;
	
	ЕстьКолонкаЦМО              = ДанныеПервойСтроки.Свойство("ЦМО");
	ЕстьКолонкаПодразделение    = ДанныеПервойСтроки.Свойство("Подразделение");
	ЕстьКолонкаСостояние        = ДанныеПервойСтроки.Свойство("Состояние");
	ЕстьКолонкиСвойстваИнвНом   = ДанныеПервойСтроки.Свойство("ЗаводскойНомер")
		ИЛИ ДанныеПервойСтроки.Свойство("РеестровыйНомер")
		ИЛИ ДанныеПервойСтроки.Свойство("НомерПаспорта")
		ИЛИ ДанныеПервойСтроки.Свойство("ДатаВыпуска");
	ЕстьКолонкаИнвентарныйНомер = ДанныеПервойСтроки.Свойство("ИнвентарныйНомер")
		ИЛИ ЕстьКолонкиСвойстваИнвНом;
	
	ПолучитьДанныеИнвентарныхКарточек = ДанныеПервойСтроки.Свойство("НомерИнвентарнойКарточки")
		ИЛИ ДанныеПервойСтроки.Свойство("ДатаИнвентарнойКарточки");
	ПолучитьУчетныеДанные = ДанныеПервойСтроки.Свойство("СчетУчета")
		ИЛИ ДанныеПервойСтроки.Свойство("ВидУчета")
		ИЛИ ДанныеПервойСтроки.Свойство("ВидИмущества")
		ИЛИ ДанныеПервойСтроки.Свойство("КФО")
		ИЛИ ДанныеПервойСтроки.Свойство("КПС");
	ПолучитьМестнонахождение = ЕстьКолонкаЦМО
		ИЛИ ЕстьКолонкаПодразделение Или ЕстьКолонкаИнвентарныйНомер;
	ПолучитьСостояние = ЕстьКолонкаСостояние;
	
	НедоступныеДанныеЦвет = Метаданные.ЭлементыСтиля.НедоступныеДанныеЦвет.Значение;
	
	ОбъектыОС = Новый Массив;
	Для Каждого ТекСтрока Из Строки Цикл
		ТекущиеДанные = ТекСтрока.Значение.Данные;
		ОбъектыОС.Добавить(ТекущиеДанные.Ссылка);
	КонецЦикла;
	
	// Если есть только один отобор по организации, не включенный в группы, то используем его.
	// В остальных случаях читаем фактические организации из строк списка.
	ОтборОрганизация = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Настройки.Отбор, "Организация");
	Организация = Неопределено;
	КоличествоЭлементовОтбора = 0;
	Для Каждого ЭлементОтбора Из ОтборОрганизация Цикл
		
		Если ЭлементОтбора.Использование Тогда
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И ЭлементОтбора.Родитель = Неопределено Тогда
				КоличествоЭлементовОтбора = КоличествоЭлементовОтбора + 1;
				Организация = ЭлементОтбора.ПравоеЗначение;
			Иначе
				КоличествоЭлементовОтбора = 2;
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоЭлементовОтбора <> 1 Тогда
		Организация = ОрганизацияВыбранныхОС(ОбъектыОС);
	КонецЕсли;
	
	// Получаем необходимые данные

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НетОтбораПоОрганизации", НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организации", Организация);
	Запрос.УстановитьПараметр("ОсновныеСредства", ОбъектыОС);
	
	ИндексТаблицы = -1;
	ИндексыТаблиц = Новый Структура();	
	Если ПолучитьДанныеИнвентарныхКарточек Тогда
		ТекстЗапроса_ДанныеИнвентарныхКарточек(Запрос, ИндексТаблицы);
		ИндексыТаблиц.Вставить("ДанныеИнвентарныхКарточекОС", ИндексТаблицы);	
	КонецЕсли;
	Если ПолучитьУчетныеДанные Тогда
		ТекстЗапроса_УчетныеДанныеОбъектов(Запрос, ИндексТаблицы);
		ИндексыТаблиц.Вставить("УчетныеДанныеОбъектовОС", ИндексТаблицы);	

		ТекстЗапроса_УчетныеДанныеПравПользования(Запрос, ИндексТаблицы);
		ИндексыТаблиц.Вставить("УчетныеДанныеОбъектовПП", ИндексТаблицы);	
	КонецЕсли;
	Если ПолучитьМестнонахождение Тогда
		ТекстЗапроса_МестонахождениеОбъектовОС(Запрос, ИндексТаблицы, ЕстьКолонкиСвойстваИнвНом);
		ИндексыТаблиц.Вставить("МестонахождениеОбъектовОС", ИндексТаблицы);	
	КонецЕсли;
	Если ПолучитьСостояние Тогда
		ТекстЗапроса_СостояниеОбъектовОС(Запрос, ИндексТаблицы);
		ИндексыТаблиц.Вставить("СостояниеОбъектовОС", ИндексТаблицы);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		УстановитьПривилегированныйРежим(Ложь);
	
		Если ПолучитьДанныеИнвентарныхКарточек Тогда
			ДанныеИнвентарныхКарточекОС = ЗаполнитьРезультат_ДанныеИнвентарныхКарточек(РезультатЗапроса, ИндексыТаблиц);
		КонецЕсли;	
		Если ПолучитьУчетныеДанные Тогда
			УчетныеДанныеОбъектовОС = ЗаполнитьРезультат_УчетныеДанныеОбъектов(РезультатЗапроса, ИндексыТаблиц);
			УчетныеДанныеОбъектовПП = ЗаполнитьРезультат_УчетныеДанныеПравПользования(РезультатЗапроса, ИндексыТаблиц);
		КонецЕсли;	
		Если ПолучитьМестнонахождение Тогда
			МестонахождениеОбъектовОС = ЗаполнитьРезультат_МестонахождениеОбъектовОС(
				РезультатЗапроса, ИндексыТаблиц, ЕстьКолонкиСвойстваИнвНом);
		КонецЕсли;		
		Если ПолучитьСостояние Тогда
			СостояниеОбъектовОС = ЗаполнитьРезультат_СостояниеОбъектовОС(РезультатЗапроса, ИндексыТаблиц);
		КонецЕсли;	
	КонецЕсли;	

	// Выводим данные в список
	
	Для каждого ТекСтрока Из Строки Цикл
		
		ТекущиеДанные = ТекСтрока.Значение.Данные;
		
		Если ПолучитьДанныеИнвентарныхКарточек Тогда
			ДанныеИнвКарточки = ДанныеИнвентарныхКарточекОС.Получить(ТекущиеДанные.Ссылка);
			Если ДанныеИнвКарточки <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеИнвКарточки);
			КонецЕсли;
		КонецЕсли;
		
		Если ПолучитьУчетныеДанные Тогда
			УчетныеДанные = УчетныеДанныеОбъектовОС.Получить(ТекущиеДанные.Ссылка);
			Если УчетныеДанные <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущиеДанные, УчетныеДанные);
			КонецЕсли;

			УчетныеДанные = УчетныеДанныеОбъектовПП.Получить(ТекущиеДанные.Ссылка);
			Если УчетныеДанные <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущиеДанные, УчетныеДанные);
			КонецЕсли;
		КонецЕсли;
		
		Если ПолучитьМестнонахождение Тогда
			Если НЕ ТекущиеДанные.ЭтоГруппа И НЕ ТекущиеДанные.ГрупповойУчет Тогда
				Местонахождение = МестонахождениеОбъектовОС.Получить(ТекущиеДанные.Ссылка);
				Если Местонахождение <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ТекущиеДанные, Местонахождение);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ПолучитьСостояние Тогда
			Если Не ТекущиеДанные.ЭтоГруппа И НЕ ТекущиеДанные.ГрупповойУчет Тогда
				Состояние = СостояниеОбъектовОС.Получить(ТекущиеДанные.Ссылка);
				Если Состояние <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ТекущиеДанные, Состояние);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Оформление строки
		
		ТекущееОформление = ТекСтрока.Значение.Оформление;
		
		Если Не ТекущиеДанные.ЭтоГруппа Тогда
			
			Если ТекущиеДанные.ГрупповойУчет Тогда
				
				Если ЕстьКолонкаИнвентарныйНомер Тогда
					ТекущееОформление["ИнвентарныйНомер"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<групповой учет>'"));
					ТекущееОформление["ИнвентарныйНомер"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
				КонецЕсли;
				
				Если ЕстьКолонкаЦМО Тогда
					ТекущееОформление["ЦМО"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<групповой учет>'"));
					ТекущееОформление["ЦМО"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
				КонецЕсли;
				
				Если ЕстьКолонкаСостояние Тогда
					ТекущееОформление["Состояние"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<групповой учет>'"));
					ТекущееОформление["Состояние"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
				КонецЕсли;
				
				Если ЕстьКолонкаПодразделение Тогда
					ТекущееОформление["Подразделение"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<групповой учет>'"));
					ТекущееОформление["Подразделение"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
				КонецЕсли;
				
			Иначе
				
				Если ЕстьКолонкаИнвентарныйНомер И ТекущиеДанные.ИнвентарныйНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка() Тогда
					
					ТекущееОформление["ИнвентарныйНомер"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<не задан>'"));
					ТекущееОформление["ИнвентарныйНомер"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
					
				КонецЕсли;
				
				Если ЕстьКолонкаЦМО И ТекущиеДанные.ЦМО = Справочники.ЦМО.ПустаяСсылка() Тогда
					
					ТекущееОформление["ЦМО"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<не задан>'"));
					ТекущееОформление["ЦМО"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
					
				КонецЕсли;
				
				Если ЕстьКолонкаСостояние И ТекущиеДанные.Состояние = Перечисления.СостоянияОС.ПустаяСсылка() Тогда
					
					ТекущееОформление["Состояние"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<не задано>'"));
					ТекущееОформление["Состояние"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
					
				КонецЕсли;
				
				Если ЕстьКолонкаПодразделение И ТекущиеДанные.Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
					
					ТекущееОформление["Подразделение"].УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<не задано>'"));
					ТекущееОформление["Подразделение"].УстановитьЗначениеПараметра("ЦветТекста", НедоступныеДанныеЦвет);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ТекущееОформление.Получить("ГрупповойУчет") <> Неопределено Тогда
				ТекущееОформление["ГрупповойУчет"].УстановитьЗначениеПараметра("Отображать", Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.СписокВыбор(ЭтотОбъект, Поле, ВыбраннаяСтрока, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеИнвентарныхНомеров(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Формирование инвентарных номеров не доступно для групп.'"));
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Организация,ОсновноеСредство", ТекущиеДанные.Организация, ТекущиеДанные.Ссылка);
	ПараметрыФормы = Новый Структура("ДополнительныеПараметры", ДопПараметры);
	ОткрытьФорму("Справочник.ИнвентарныеНомераОС.Форма.ФормаФормированиеИнвентарныхНомеров", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеШтрихкодов(Команда)
	
	МассивОбъектов = Новый Массив;
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого ОС Из ВыделенныеСтроки Цикл
		МассивОбъектов.Добавить(ОС);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("МассивОбъектов", МассивОбъектов);
	ОткрытьФорму("РегистрСведений.ШтрихКоды.Форма.ФормаСозданияШтрихкодовОС", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповойВвод(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Организация = ОтборОрганизацияИзСписка();
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыФормы.Вставить("Организация", Организация);
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормыГрупповогоВводаОС");
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ГрупповойВвод", ПараметрыФормы,,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяПечать(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Организация = ОтборОрганизацияИзСписка();
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыФормы.Вставить("Организация", Организация);
	КонецЕсли;
	
	СписокОС = Новый Массив;
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого ОС Из ВыделенныеСтроки Цикл
		СписокОС.Добавить(ОС);
	КонецЦикла;
	
	ПараметрыФормы.Вставить("СписокОС", СписокОС);
	
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ГрупповаяПечатьИнвентарныхКарточек", ПараметрыФормы,,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	
	СписокОС = Новый Массив;
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого ОС Из ВыделенныеСтроки Цикл  
		Если НЕ ЗначениеЗаполнено(ОС) Тогда
			Продолжить;
		КонецЕсли;	
		СписокОС.Добавить(ОС);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("МассивОбъектов", СписокОС);
	ОткрытьФорму("Обработка.ПечатьЭтикеток.Форма", ПараметрыФормы,,УникальныйИдентификатор);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Информационный центр
&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры
// Конец Информационный центр

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НайтиОбъектПоШтрихкоду(Знач Штрихкод)
	
	Возврат РегистрыСведений.Штрихкоды.НайтиОбъектПоШтрихкоду(Штрихкод).ОсновноеСредство;
	
КонецФункции

&НаСервере
Процедура УстановитьОграничениеПолей()
	
	// Поля, которые рассчитываются в обработчике ПриПолученииДанныхНаСервере
	// нельзя использовать в отборе, группировке и порядке.
	
	ИзменяемыеПоля = Новый Массив;
	ИзменяемыеПоля.Добавить("НомерИнвентарнойКарточки");
	ИзменяемыеПоля.Добавить("ДатаИнвентарнойКарточки");
	ИзменяемыеПоля.Добавить("СчетУчета");
	ИзменяемыеПоля.Добавить("ВидУчета");
	ИзменяемыеПоля.Добавить("ВидИмущества");
	ИзменяемыеПоля.Добавить("КФО");
	ИзменяемыеПоля.Добавить("КПС");
	ИзменяемыеПоля.Добавить("ЦМО");
	ИзменяемыеПоля.Добавить("ИнвентарныйНомер");
	ИзменяемыеПоля.Добавить("Состояние");
	ИзменяемыеПоля.Добавить("Подразделение");
	
	Список.УстановитьОграниченияИспользованияВОтборе(ИзменяемыеПоля);
	Список.УстановитьОграниченияИспользованияВГруппировке(ИзменяемыеПоля);
	Список.УстановитьОграниченияИспользованияВПорядке(ИзменяемыеПоля);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОрганизацияВыбранныхОС(ОбъектыОС)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.Организация КАК Организация
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&ОбъектыОС)
	|	И ОсновныеСредства.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОбъектыОС", ОбъектыОС);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Результат.Количество() = 1 Тогда
		Возврат Результат[0].Организация;
	Иначе
		Возврат Результат.ВыгрузитьКолонку("Организация");
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ТекстЗапроса_ДанныеИнвентарныхКарточек(Запрос, ИндексТаблицы)
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ
	|	НомераИнвентарныхКарточекСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	НомераИнвентарныхКарточекСрезПоследних.НомерИнвентарнойКарточки КАК НомерИнвентарнойКарточки,
	|	НомераИнвентарныхКарточекСрезПоследних.ДатаИнвентарнойКарточки КАК ДатаИнвентарнойКарточки
	|ИЗ
	|	РегистрСведений.НомераИнвентарныхКарточек.СрезПоследних(, (&НетОтбораПоОрганизации
	|	ИЛИ Организация В (&Организации))
	|	И ОсновноеСредство В (&ОсновныеСредства)) КАК НомераИнвентарныхКарточекСрезПоследних";

	ИндексТаблицы = ИндексТаблицы + 1;	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ТекстЗапроса_УчетныеДанныеОбъектов(Запрос, ИндексТаблицы)
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета КАК ВидУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества КАК ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО КАК КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС КАК КПС,
	|	ВЫБОР
	|		КОГДА УчетныеДанныеОбъектаОССрезПоследних.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаБалансе)
	|			ТОГДА 1
	|		КОГДА УчетныеДанныеОбъектаОССрезПоследних.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.ВПути)
	|			ТОГДА 2
	|		КОГДА УчетныеДанныеОбъектаОССрезПоследних.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.Арендованные)
	|			ТОГДА 3
	|		КОГДА УчетныеДанныеОбъектаОССрезПоследних.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаОтветственномХранении)
	|			ТОГДА 4
	|		КОГДА УчетныеДанныеОбъектаОССрезПоследних.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.КапВложение)
	|			ТОГДА 5
	|		ИНАЧЕ 6
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(, (&НетОтбораПоОрганизации
	|	ИЛИ Организация В (&Организации))
	|	И ОсновноеСредство В (&ОсновныеСредства)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ
	|ПО
	|	ОсновноеСредство";

	ИндексТаблицы = ИндексТаблицы + 1;	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ТекстЗапроса_УчетныеДанныеПравПользования(Запрос, ИндексТаблицы)
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПраваПользования
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В (&ОсновныеСредства)
	|	И ОсновныеСредства.ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ПраваПользованияИмуществом)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(Остатки11140.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	Остатки11140.Счет КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.ПустаяСсылка) КАК ВидУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка) КАК ВидИмущества,
	|	Остатки11140.КФО КАК КФО,
	|	Остатки11140.КПС КАК КПС,
	|	ВЫРАЗИТЬ(Остатки11140.Субконто2 КАК Справочник.ЦМО) КАК ЦМО,
	|	ВЫБОР
	|		КОГДА Остатки11140.Счет.УчетПоПодразделениям
	|			ТОГДА ЕСТЬNULL(Остатки11140.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(, Счет В (&Счета11140), &ВидыСубконтоОСЦМО, (&НетОтбораПоОрганизации
	|	ИЛИ Организация В (&Организации))
	|	И Субконто1 В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			ПраваПользования КАК Таб)) КАК Остатки11140";

	Если НЕ Запрос.Параметры.Свойство("Счета11140") Тогда
		Запрос.УстановитьПараметр("Счета11140", БухгалтерскийУчет.СписокСчетов("111.40"));
	КонецЕсли;	
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	Запрос.УстановитьПараметр("ВидыСубконтоОСЦМО", ВидыСубконто);

	ИндексТаблицы = ИндексТаблицы + 2;	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ТекстЗапроса_МестонахождениеОбъектовОС(Запрос, ИндексТаблицы, ЕстьКолонкиСвойстваИнвНом)
	ТекстЗапросаДляБаланса = 
	"ВЫБРАТЬ
	|	МестонахождениеОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОССрезПоследних.ЦМО КАК ЦМО,
	|	МестонахождениеОССрезПоследних.Подразделение КАК Подразделение,
	|	МестонахождениеОССрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер";
	
	ТекстЗапросаДляЗабаланса = 
	"ВЫБРАТЬ
	|	ОбъектыЗабалансом.ОсновноеСредство КАК ОсновноеСредство,
	|	ОбъектыЗабалансом.ЦМО КАК ЦМО,
	|	ОбъектыЗабалансом.Подразделение КАК Подразделение,
	|	ОбъектыЗабалансом.ИнвентарныйНомер КАК ИнвентарныйНомер";
	
	Если ЕстьКолонкиСвойстваИнвНом Тогда
		ТекстЗапросаДляБаланса = ТекстЗапросаДляБаланса + ",
		|	МестонахождениеОССрезПоследних.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
		|	МестонахождениеОССрезПоследних.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
		|	МестонахождениеОССрезПоследних.ИнвентарныйНомер.НомерПаспорта КАК НомерПаспорта,
		|	МестонахождениеОССрезПоследних.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска";

		ТекстЗапросаДляЗабаланса = ТекстЗапросаДляЗабаланса + ", 
		|	ОбъектыЗабалансом.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
		|	ОбъектыЗабалансом.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
		|	ОбъектыЗабалансом.ИнвентарныйНомер.НомерПаспорта КАК НомерПаспорта,
		|	ОбъектыЗабалансом.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска";
	КонецЕсли;
	ТекстЗапросаДляБаланса = ТекстЗапросаДляБаланса + "
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			,
	|			(&НетОтбораПоОрганизации ИЛИ Организация В (&Организации))
	|				И ОсновноеСредство В (&ОсновныеСредства)) КАК МестонахождениеОССрезПоследних";

	ТекстЗапросаДляЗабаланса = ТекстЗапросаДляЗабаланса + " 
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(
	|			,
	|			(&НетОтбораПоОрганизации ИЛИ Организация В (&Организации))
	|				И ОсновноеСредство В (&ОсновныеСредства)
	|				И НЕ ВидРаспоряжения В (
	|					ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление),
	|					ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду),
	|					ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование),
	|					ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|				)
	|	) КАК ОбъектыЗабалансом";

	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") 
		+ ТекстЗапросаДляБаланса 
		+ ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") 
		+ ТекстЗапросаДляЗабаланса; 

	ИндексТаблицы = ИндексТаблицы + 1;	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ТекстЗапроса_СостояниеОбъектовОС(Запрос, ИндексТаблицы)
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьПринятиеКУчету,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьВводВЭксплуатацию,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(, (&НетОтбораПоОрганизации
	|	ИЛИ Организация В (&Организации))
	|	И ОсновноеСредство В (&ОсновныеСредства)) КАК СобытияОС
	|ГДЕ
	|	СобытияОС.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПраваПользования11140.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ПраваПользования11140.СуммаОборотДт > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПринятиеКУчету,
	|	ЛОЖЬ КАК ЕстьВводВЭксплуатацию,
	|	ВЫБОР
	|		КОГДА ПраваПользования11140.СуммаОборотДт > 0
	|		И ПраваПользования11140.СуммаКонечныйОстаток = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_ПраваПользования11140
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОстаткиИОбороты(,,,, Счет В (&Счета11140),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства), (&НетОтбораПоОрганизации
	|	ИЛИ Организация В (&Организации))
	|	И Субконто1 В (&ОсновныеСредства)) КАК ПраваПользования11140
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_СобытияОС.ЕстьПринятиеКУчету КАК ЕстьПринятиеКУчету,
	|	ВТ_СобытияОС.ЕстьВводВЭксплуатацию КАК ЕстьВводВЭксплуатацию,
	|	ВТ_СобытияОС.ЕстьСписание КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_События
	|ИЗ
	|	ВТ_СобытияОС КАК ВТ_СобытияОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПраваПользования11140.ОсновноеСредство,
	|	ВТ_ПраваПользования11140.ЕстьПринятиеКУчету,
	|	ВТ_ПраваПользования11140.ЕстьВводВЭксплуатацию,
	|	ВТ_ПраваПользования11140.ЕстьСписание
	|ИЗ
	|	ВТ_ПраваПользования11140 КАК ВТ_ПраваПользования11140
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_События.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ВТ_События.ОсновноеСредство ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	|		КОГДА ВТ_События.ЕстьСписание
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|		КОГДА ВТ_События.ЕстьВводВЭксплуатацию
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|		КОГДА ВТ_События.ЕстьПринятиеКУчету
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние
	|ИЗ
	|	ВТ_События КАК ВТ_События";

	// Права пользования ОС, НПА (111.40).
	// По объектам вида "Права пользования ОС, НПА" данные в регистре СобытияОС не формируются,
	// поэтому получаем их по остаткам и оборотам счетов 111.40.
	Если НЕ Запрос.Параметры.Свойство("Счета11140") Тогда
		Запрос.УстановитьПараметр("Счета11140", БухгалтерскийУчет.СписокСчетов("111.40"));
	КонецЕсли;	

	ИндексТаблицы = ИндексТаблицы + 4;	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ЗаполнитьРезультат_ДанныеИнвентарныхКарточек(РезультатЗапроса, ИндексыТаблиц)
	Результат = Новый Соответствие();
	ИндексТаблицы = Неопределено;
	Если ИндексыТаблиц.Свойство("ДанныеИнвентарныхКарточекОС", ИндексТаблицы) Тогда
		Выборка = РезультатЗапроса[ИндексТаблицы].Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Данные = Новый Структура("НомерИнвентарнойКарточки, ДатаИнвентарнойКарточки",
				Выборка.НомерИнвентарнойКарточки, Выборка.ДатаИнвентарнойКарточки);
			Результат.Вставить(Выборка.ОсновноеСредство, Данные);
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьРезультат_УчетныеДанныеОбъектов(РезультатЗапроса, ИндексыТаблиц)
	Результат = Новый Соответствие();
	ИндексТаблицы = Неопределено;
	Если ИндексыТаблиц.Свойство("УчетныеДанныеОбъектовОС", ИндексТаблицы) Тогда
		ВыборкаОС = РезультатЗапроса[ИндексТаблицы].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОС.Следующий() Цикл
			Выборка = ВыборкаОС.Выбрать();
			Если Выборка.Следующий() Тогда
				Данные = Новый Структура("СчетУчета, ВидУчета, ВидИмущества, КФО, КПС");
				ЗаполнитьЗначенияСвойств(Данные, Выборка);
				Результат.Вставить(Выборка.ОсновноеСредство, Данные);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	

	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьРезультат_УчетныеДанныеПравПользования(РезультатЗапроса, ИндексыТаблиц)
	// Права пользования ОС, НПА (111.40).
	// По объектам вида "Права пользования ОС, НПА" данные в регистре УчетныеДанныеОбъектаОС не формируются,
	// поэтому получаем их по остаткам счетов 111.40.
	Результат = Новый Соответствие();
	ИндексТаблицы = Неопределено;
	Если ИндексыТаблиц.Свойство("УчетныеДанныеОбъектовПП", ИндексТаблицы) Тогда
		Выборка = РезультатЗапроса[ИндексТаблицы].Выбрать();
		Пока Выборка.Следующий() Цикл
			Данные = Новый Структура("СчетУчета, ВидУчета, ВидИмущества, КФО, КПС, ЦМО, Подразделение");
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
			Результат.Вставить(Выборка.ОсновноеСредство, Данные);
		КонецЦикла;
	КонецЕсли;	

	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьРезультат_МестонахождениеОбъектовОС(РезультатЗапроса, ИндексыТаблиц, ЕстьКолонкиСвойстваИнвНом)
	Если ЕстьКолонкиСвойстваИнвНом Тогда
		СтрокаИменСвойств = "ЦМО, Подразделение, ИнвентарныйНомер, ЗаводскойНомер, РеестровыйНомер, НомерПаспорта, ДатаВыпуска";
	Иначе
		СтрокаИменСвойств = "ЦМО, Подразделение, ИнвентарныйНомер";
	КонецЕсли;
	
	Результат = Новый Соответствие();
	ИндексТаблицы = Неопределено;
	Если ИндексыТаблиц.Свойство("МестонахождениеОбъектовОС", ИндексТаблицы) Тогда
		Выборка = РезультатЗапроса[ИндексТаблицы].Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Данные = Новый Структура(СтрокаИменСвойств);
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
			Результат.Вставить(Выборка.ОсновноеСредство, Данные);
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьРезультат_СостояниеОбъектовОС(РезультатЗапроса, ИндексыТаблиц)
	Результат = Новый Соответствие();
	ИндексТаблицы = Неопределено;
	Если ИндексыТаблиц.Свойство("СостояниеОбъектовОС", ИндексТаблицы) Тогда
		Выборка = РезультатЗапроса[ИндексТаблицы].Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Данные = Новый Структура("Состояние", Выборка.Состояние);
			Результат.Вставить(Выборка.ОсновноеСредство, Данные);
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьБыстрыеОтборы()
	
	Элементы.ГруппаОтборы.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Быстрые отборы (УСТАНОВЛЕНЫ)'");
	
	ОрганизацияОтбора = ОтборОрганизацияИзСписка();
	
	ТаблицыЗапроса = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НетОтбораПоОрганизации", НЕ ЗначениеЗаполнено(ОрганизацияОтбора));
	Запрос.УстановитьПараметр("Организация", ОрганизацияОтбора);
	Запрос.УстановитьПараметр("НетОтбораПоЦМО", НЕ ИспользоватьОтборЦМО);
	Запрос.УстановитьПараметр("ЦМО", ОтборЦМО);
	Запрос.УстановитьПараметр("НетОтбораПоПодразделению", НЕ ИспользоватьОтборПодразделение);
	Запрос.УстановитьПараметр("Подразделение", ОтборПодразделение);
	Запрос.УстановитьПараметр("Состояние", ОтборСостояние);
	Запрос.УстановитьПараметр("Счета11140", БухгалтерскийУчет.СписокСчетов("111.40"));
	ВидыСубконто11140 = Новый Массив;
	ВидыСубконто11140.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	ВидыСубконто11140.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	Запрос.УстановитьПараметр("ВидыСубконто11140", ВидыСубконто11140);
	Запрос.УстановитьПараметр("СчетУчета", ОтборСчетУчета);
	
	ТекстЗапроса_СсылкиПоИнвНомеру(Запрос, ТаблицыЗапроса);
	ТекстЗапроса_СсылкиПоМестонахождению(Запрос, ТаблицыЗапроса);
	ТекстЗапроса_СсылкиПоСостоянию(Запрос, ТаблицыЗапроса);
	ТекстЗапроса_СсылкиПоСчетуУчета(Запрос, ТаблицыЗапроса);

	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат;
	КонецЕсли;	
	
	СоединитьЗапросы(Запрос, ТаблицыЗапроса);
	СсылкиОС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	
	ОтборСписок = Новый СписокЗначений;
	ОтборСписок.ЗагрузитьЗначения(СсылкиОС);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ОтборСсылка", ОтборСписок, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
КонецПроцедуры

&НаСервере
Процедура ТекстЗапроса_СсылкиПоИнвНомеру(Запрос, ТаблицыЗапроса)
	Если (Не ИспользоватьОтборИнвентарныйНомер Или ПустаяСтрока(ОтборИнвентарныйНомер))
		И (Не ИспользоватьОтборРеестровыйНомер Или ПустаяСтрока(ОтборРеестровыйНомер)) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ
	|	ИнвентарныеНомераОС.ОС КАК ОсновноеСредство
	|ПОМЕСТИТЬ СсылкиПоИнвНомеру
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	(&НетОтбораПоОрганизации ИЛИ ИнвентарныеНомераОС.Владелец = &Организация)
	|	И &УсловиеИнвНомера 
	|	И &УсловиеРеестровыйНомер
	|";
	
	УсловиеИнвНомера = "ИСТИНА";
	Если ИспользоватьОтборИнвентарныйНомер И ЗначениеЗаполнено(ОтборИнвентарныйНомер) Тогда
		УсловиеИнвНомера = "ИнвентарныеНомераОС.Код ПОДОБНО &Код";
		Запрос.УстановитьПараметр("Код", "%" + СокрП(ОтборИнвентарныйНомер) + "%");
	КонецЕсли;	
	УсловиеРеестровыйНомер = "ИСТИНА";
	Если ИспользоватьОтборРеестровыйНомер И ЗначениеЗаполнено(ОтборРеестровыйНомер) Тогда
		УсловиеРеестровыйНомер = "ИнвентарныеНомераОС.РеестровыйНомер ПОДОБНО &РеестровыйНомер";
		Запрос.УстановитьПараметр("РеестровыйНомер", "%" + СокрП(ОтборРеестровыйНомер) + "%");
	КонецЕсли;	

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИнвНомера", УсловиеИнвНомера);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРеестровыйНомер", УсловиеРеестровыйНомер);	
	
	ТаблицыЗапроса.Добавить("СсылкиПоИнвНомеру");
КонецПроцедуры

&НаСервере
Процедура ТекстЗапроса_СсылкиПоМестонахождению(Запрос, ТаблицыЗапроса)
	Если Не ИспользоватьОтборЦМО
		И Не ИспользоватьОтборПодразделение Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ СтоимостьОбъектовОСОстатки
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(, (&НетОтбораПоОрганизации
	|	ИЛИ Организация = &Организация)
	|	И (&НетОтбораПоЦМО
	|	ИЛИ ЦМО = &ЦМО)
	|	И (&НетОтбораПоПодразделению
	|	ИЛИ Подразделение = &Подразделение)) КАК СтоимостьОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Остатки11140.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство
	|ПОМЕСТИТЬ Остатки11140
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(, Счет В (&Счета11140), &ВидыСубконто11140, (&НетОтбораПоОрганизации
	|	ИЛИ Организация = &Организация)
	|	И (&НетОтбораПоЦМО
	|	ИЛИ Субконто2 = &ЦМО)
	|	И (&НетОтбораПоПодразделению
	|	ИЛИ Подразделение = &Подразделение)) КАК Остатки11140
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ СсылкиПоМестонахождению
	|ИЗ
	|	СтоимостьОбъектовОСОстатки КАК СтоимостьОбъектовОСОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки11140.ОсновноеСредство
	|ИЗ
	|	Остатки11140 КАК Остатки11140";
	
	ТаблицыЗапроса.Добавить("СсылкиПоМестонахождению");
КонецПроцедуры

&НаСервере
Процедура ТекстЗапроса_СсылкиПоСостоянию(Запрос, ТаблицыЗапроса)
	
	Если Не ИспользоватьОтборСостояние Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
	"ВЫБРАТЬ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьПринятиеКУчету,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьВводВЭксплуатацию,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(, (&НетОтбораПоОрганизации
	|	ИЛИ Организация = &Организация)) КАК СобытияОС
	|ГДЕ
	|	СобытияОС.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПраваПользования11140.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ПраваПользования11140.СуммаОборотДт > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПринятиеКУчету,
	|	ЛОЖЬ КАК ЕстьВводВЭксплуатацию,
	|	ВЫБОР
	|		КОГДА ПраваПользования11140.СуммаОборотДт > 0
	|		И ПраваПользования11140.СуммаКонечныйОстаток = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_ПраваПользования11140
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОстаткиИОбороты(,,,, Счет В (&Счета11140),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства), (&НетОтбораПоОрганизации
	|	ИЛИ Организация = &Организация)) КАК ПраваПользования11140
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_СобытияОС.ЕстьПринятиеКУчету КАК ЕстьПринятиеКУчету,
	|	ВТ_СобытияОС.ЕстьВводВЭксплуатацию КАК ЕстьВводВЭксплуатацию,
	|	ВТ_СобытияОС.ЕстьСписание КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_События
	|ИЗ
	|	ВТ_СобытияОС КАК ВТ_СобытияОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПраваПользования11140.ОсновноеСредство,
	|	ВТ_ПраваПользования11140.ЕстьПринятиеКУчету,
	|	ВТ_ПраваПользования11140.ЕстьВводВЭксплуатацию,
	|	ВТ_ПраваПользования11140.ЕстьСписание
	|ИЗ
	|	ВТ_ПраваПользования11140 КАК ВТ_ПраваПользования11140
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_События.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ СсылкиПоСостоянию
	|ИЗ
	|	ВТ_События КАК ВТ_События
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ВТ_События.ОсновноеСредство ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	|		КОГДА ВТ_События.ЕстьСписание
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|		КОГДА ВТ_События.ЕстьВводВЭксплуатацию
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|		КОГДА ВТ_События.ЕстьПринятиеКУчету
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	|	КОНЕЦ = &Состояние";
	
	ТаблицыЗапроса.Добавить("СсылкиПоСостоянию");
КонецПроцедуры

&НаСервере
Процедура ТекстЗапроса_СсылкиПоСчетуУчета(Запрос, ТаблицыЗапроса)
	Если Не ИспользоватьОтборСчетУчета Тогда
		Возврат;
	КонецЕсли;
	
	Если БухгалтерскийУчет.СчетВИерархии(ОтборСчетУчета, "111.40") Тогда
		// Права пользования ОС, НПА (111.40).
		// По объектам вида "Права пользования ОС, НПА" данные в регистре УчетныеДанныеОбъектаОС не формируются,
		// поэтому получаем их по остаткам счетов 111.40.
		Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Остатки11140.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство
		|ПОМЕСТИТЬ СсылкиПоСчетуУчета
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(, Счет В (&СчетУчета), 
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства), (&НетОтбораПоОрганизации
		|	ИЛИ Организация = &Организация)) КАК Остатки11140";
	Иначе
		Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") +
		"ВЫБРАТЬ
		|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ СсылкиПоСчетуУчета
		|ИЗ
		|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(, (&НетОтбораПоОрганизации
		|	ИЛИ Организация = &Организация)) КАК УчетныеДанныеОбъектаОССрезПоследних
		|ГДЕ
		|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета = &СчетУчета";
	КонецЕсли;
	
	ТаблицыЗапроса.Добавить("СсылкиПоСчетуУчета");
КонецПроцедуры

&НаСервере
Процедура СоединитьЗапросы(Запрос, ТаблицыЗапроса)
	ЭтоПерваяТаблица = Истина;
	ТекстЗапроса = "";
	ИмяПервойТаблицы = "";
	Для каждого ИмяТаблицы из ТаблицыЗапроса Цикл
		Если ЭтоПерваяТаблица Тогда
			ТекстЗапроса = "
			|Выбрать
			|	" + ИмяТаблицы + ".ОсновноеСредство КАК ОсновноеСредство
			|ИЗ
			|	" + ИмяТаблицы + " КАК " + ИмяТаблицы;
			
			ЭтоПерваяТаблица = Ложь;
			ИмяПервойТаблицы = ИмяТаблицы;
			Продолжить;
		КонецЕсли;	
		
		ТекстЗапроса = ТекстЗапроса + " 
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ИмяТаблицы + " КАК " + ИмяТаблицы + "
		|	ПО " + ИмяПервойТаблицы + ".ОсновноеСредство = " + ИмяТаблицы + ".ОсновноеСредство";
	КонецЦикла;	
	Запрос.Текст = Запрос.Текст + 
		?(ЗначениеЗаполнено(Запрос.Текст), ОбщегоНазначения.РазделительПакетаЗапросов(), "") + ТекстЗапроса;
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьБыстрыйОтбор()
	
	Использовать = ИспользоватьБыстрыеОтборы
		И (ИспользоватьОтборИнвентарныйНомер
			ИЛИ ИспользоватьОтборСчетУчета
			ИЛИ ИспользоватьОтборЦМО
			ИЛИ ИспользоватьОтборПодразделение
			ИЛИ ИспользоватьОтборСостояние
			ИЛИ ИспользоватьОтборРеестровыйНомер);
	
	Если Использовать Тогда
		УстановитьБыстрыеОтборы();
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОтборСсылка",,,,Ложь);
		Элементы.ГруппаОтборы.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Быстрые отборы'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтборОрганизацияИзСписка()
	
	ОрганизацияОтбора = Неопределено;
	ИспользуемыеНастройки = Список.КомпоновщикНастроек.ПолучитьНастройки();
	
	ОтборОрганизация = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ИспользуемыеНастройки.Отбор, "Организация");
	Для каждого ЭлементОтбора Из ОтборОрганизация Цикл
		
		Если ЭлементОтбора.Использование Тогда
			Если ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.Равно Тогда
				ОрганизацияОтбора = Неопределено;
				Прервать;
			Иначе
				Если ОрганизацияОтбора <> Неопределено И ОрганизацияОтбора <> ЭлементОтбора.ПравоеЗначение Тогда
					ОрганизацияОтбора = Неопределено;
					Прервать;
				Иначе
					ОрганизацияОтбора = ЭлементОтбора.ПравоеЗначение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОрганизацияОтбора;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораЭлементаОтбора(Элемент, СтандартнаяОбработка, ИмяСправочника, ТекущаяСтрока)
	
	ОрганизацияОтбора = ОтборОрганизацияИзСписка();
	Если ЗначениеЗаполнено(ОрганизацияОтбора) Тогда
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура("Владелец", ОрганизацияОтбора);
		ПараметрыФормыВыбора = Новый Структура("Отбор, ТекущаяСтрока", Отбор, ТекущаяСтрока);
		
		ОткрытьФорму("Справочник." + ИмяСправочника + ".ФормаВыбора",
			ПараметрыФормыВыбора, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
